note/drawio/converted/dot/260518-sv-environment.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_DsIzo_cLWOuwoU7vRuJV_1" [label="Dedicated CPU"];
  "n_DsIzo_cLWOuwoU7vRuJV_10" [label="dedicated_cpu_if"];
  "n_DsIzo_cLWOuwoU7vRuJV_12" [label="monitor"];
  "n_DsIzo_cLWOuwoU7vRuJV_13" [label="transaction"];
  "n_DsIzo_cLWOuwoU7vRuJV_15" [label="event_gen_next"];
  "n_DsIzo_cLWOuwoU7vRuJV_16" [label="scoreboard"];
  "n_DsIzo_cLWOuwoU7vRuJV_17" [label="transaction"];
  "n_DsIzo_cLWOuwoU7vRuJV_19" [label="mailbox"];
  "n_DsIzo_cLWOuwoU7vRuJV_2" [label="generator"];
  "n_DsIzo_cLWOuwoU7vRuJV_22" [label="event_drv_ready"];
  "n_DsIzo_cLWOuwoU7vRuJV_23" [label="dut"];
  "n_DsIzo_cLWOuwoU7vRuJV_4" [label="transaction"];
  "n_DsIzo_cLWOuwoU7vRuJV_6" [label="mailbox"];
  "n_DsIzo_cLWOuwoU7vRuJV_7" [label="driver"];
  "n_DsIzo_cLWOuwoU7vRuJV_8" [label="dedicated_cpu_vif"];
  "n_MJ5Diis6ZCilQXir7rq6_1" [label="envirnoument"];
  "n_MJ5Diis6ZCilQXir7rq6_15" [label="mailbox"];
  "n_MJ5Diis6ZCilQXir7rq6_17" [label="driver"];
  "n_MJ5Diis6ZCilQXir7rq6_18" [label="adder_vif"];
  "n_MJ5Diis6ZCilQXir7rq6_19" [label="adder_vif"];
  "n_MJ5Diis6ZCilQXir7rq6_20" [label="monitor"];
  "n_MJ5Diis6ZCilQXir7rq6_21" [label="adder_vif"];
  "n_MJ5Diis6ZCilQXir7rq6_22" [label="scoreboard"];
  "n_MJ5Diis6ZCilQXir7rq6_23" [label="transaction"];
  "n_MJ5Diis6ZCilQXir7rq6_24" [label="mailbox"];
  "n_MJ5Diis6ZCilQXir7rq6_3" [label="generator"];
  "n_MJ5Diis6ZCilQXir7rq6_7" [label="transaction"];
  "n_MJ5Diis6ZCilQXir7rq6_3" -> "n_MJ5Diis6ZCilQXir7rq6_15";
  "n_MJ5Diis6ZCilQXir7rq6_15" -> "n_MJ5Diis6ZCilQXir7rq6_17";
  "n_MJ5Diis6ZCilQXir7rq6_19" -> "n_MJ5Diis6ZCilQXir7rq6_20";
  "n_MJ5Diis6ZCilQXir7rq6_20" -> "n_MJ5Diis6ZCilQXir7rq6_24";
  "n_MJ5Diis6ZCilQXir7rq6_24" -> "n_MJ5Diis6ZCilQXir7rq6_22";
  "n_MJ5Diis6ZCilQXir7rq6_17" -> "n_MJ5Diis6ZCilQXir7rq6_19";
  "n_DsIzo_cLWOuwoU7vRuJV_2" -> "n_DsIzo_cLWOuwoU7vRuJV_6";
  "n_DsIzo_cLWOuwoU7vRuJV_6" -> "n_DsIzo_cLWOuwoU7vRuJV_7";
  "n_DsIzo_cLWOuwoU7vRuJV_10" -> "n_DsIzo_cLWOuwoU7vRuJV_23";
  "n_DsIzo_cLWOuwoU7vRuJV_12" -> "n_DsIzo_cLWOuwoU7vRuJV_19";
  "n_DsIzo_cLWOuwoU7vRuJV_16" -> "n_DsIzo_cLWOuwoU7vRuJV_2";
  "n_DsIzo_cLWOuwoU7vRuJV_19" -> "n_DsIzo_cLWOuwoU7vRuJV_16";
}
